In [1]:
import pandas as pd
import numpy as np

In [2]:
mylist = [5.4, 6.1, 1.7, 99.8]
myarray = np.array(mylist)

In [3]:
myseries1 = pd.Series(data=mylist)
print(myseries1)
myseries2 = pd.Series(data=mylist)
print(myseries2)

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64
0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64

In [4]:
print(myseries1[2])

1.7

In [5]:
mylabels = ['first','second','third','fourth']
myseries3 = pd.Series(data=mylist,index=mylabels)
print(myseries3)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [6]:
myseries4 = pd.Series(mylist,mylabels)
print(myseries4)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [7]:
print(myseries4['second'])

6.1

In [9]:
myseries5 = pd.Series([5.1, 1.1, 8.8, 1.6],['first','third','fourth','fifth'])
print(myseries5)
print('')
print(myseries5+myseries4)

first     5.1
third     1.1
fourth    8.8
fifth     1.6
dtype: float64

fifth       NaN
first      10.5
fourth    108.6
second      NaN
third       2.8
dtype: float64

In [10]:
df1 = pd.concat([myseries4,myseries5],axis=1,sort=False)
df1

           0    1
first    5.4  5.1
second   6.1  NaN
third    1.7  1.1
fourth  99.8  8.8
fifth    NaN  1.6

In [11]:
df2 = pd.DataFrame(np.random.randn(5,5))
df2

          0         1         2         3         4
0  0.735917  2.338687  0.517994  0.090594 -0.677770
1  0.631000 -0.720409  0.829157  0.370739 -0.183837
2 -0.574822 -1.347545 -0.295980 -0.526197  0.410526
3 -1.543987 -0.827788 -0.328237 -0.562114 -1.713667
4  0.242488  0.381972  0.167207 -0.120680  0.557802

In [12]:
df3 = pd.DataFrame(np.random.randn(5,5),index=['first row','second row','third row','fourth row','fifth row'],
                   columns=['first col','second col','third col','fourth col','fifth col'])
df3

            first col  second col  third col  fourth col  fifth col
first row   -2.128097   -1.070303   0.292057   -0.866588  -0.317536
second row  -0.639627   -0.191968  -0.083683    1.332324   2.352656
third row   -0.244611   -2.308478  -0.374073   -0.406782   0.260612
fourth row  -0.061239    0.323185   2.130186    0.573725  -0.763229
fifth row   -0.560096   -1.777736   1.440574   -1.373813   0.869684

In [13]:
print(df3['second col'])
print('')
df3[['third col', 'first col']]

first row    -1.070303
second row   -0.191968
third row    -2.308478
fourth row    0.323185
fifth row    -1.777736
Name: second col, dtype: float64

            third col  first col
first row    0.292057  -2.128097
second row  -0.083683  -0.639627
third row   -0.374073  -0.244611
fourth row   2.130186  -0.061239
fifth row    1.440574  -0.560096

In [14]:
df3.loc['fourth row']

first col    -0.061239
second col    0.323185
third col     2.130186
fourth col    0.573725
fifth col    -0.763229
Name: fourth row, dtype: float64

In [15]:
df3.iloc[2]

first col    -0.244611
second col   -2.308478
third col    -0.374073
fourth col   -0.406782
fifth col     0.260612
Name: third row, dtype: float64

In [16]:
df3.loc[['fourth row','first row'],['second col', 'third col']]

            second col  third col
fourth row    0.323185   2.130186
first row    -1.070303   0.292057

In [17]:
df3>0

            first col  second col  third col  fourth col  fifth col
first row       False       False       True       False      False
second row      False       False      False        True       True
third row       False       False      False       False       True
fourth row      False        True       True        True      False
fifth row       False       False       True       False       True

In [18]:
print(df3[df3>0])
df3[df3>0]

            first col  second col  third col  fourth col  fifth col
first row         NaN         NaN   0.292057         NaN        NaN
second row        NaN         NaN        NaN    1.332324   2.352656
third row         NaN         NaN        NaN         NaN   0.260612
fourth row        NaN    0.323185   2.130186    0.573725        NaN
fifth row         NaN         NaN   1.440574         NaN   0.869684

            first col  second col  third col  fourth col  fifth col
first row         NaN         NaN   0.292057         NaN        NaN
second row        NaN         NaN        NaN    1.332324   2.352656
third row         NaN         NaN        NaN         NaN   0.260612
fourth row        NaN    0.323185   2.130186    0.573725        NaN
fifth row         NaN         NaN   1.440574         NaN   0.869684

In [19]:
df3['sixth col'] = np.random.randn(5, 1)
df3

            first col  second col  third col  fourth col  fifth col  sixth col
first row   -2.128097   -1.070303   0.292057   -0.866588  -0.317536   0.288246
second row  -0.639627   -0.191968  -0.083683    1.332324   2.352656   0.260283
third row   -0.244611   -2.308478  -0.374073   -0.406782   0.260612   0.581615
fourth row  -0.061239    0.323185   2.130186    0.573725  -0.763229  -0.227669
fifth row   -0.560096   -1.777736   1.440574   -1.373813   0.869684   0.688371

In [20]:
df3.drop('first col', axis=1, inplace= True)

In [21]:
df3

            second col  third col  fourth col  fifth col  sixth col
first row    -1.070303   0.292057   -0.866588  -0.317536   0.288246
second row   -0.191968  -0.083683    1.332324   2.352656   0.260283
third row    -2.308478  -0.374073   -0.406782   0.260612   0.581615
fourth row    0.323185   2.130186    0.573725  -0.763229  -0.227669
fifth row    -1.777736   1.440574   -1.373813   0.869684   0.688371

In [22]:
df4 = df3.drop('first col', axis=1)
df4

KeyError: "['first col'] not found in axis"

In [ ]:
df5 = df3.drop('second row', axis=0)
df5

In [23]:
df5.reset_index()

NameError: name 'df5' is not defined

In [24]:
df5

NameError: name 'df5' is not defined

In [25]:
df5.reset_index(inplace = True)
df5

NameError: name 'df5' is not defined

In [26]:
df5 ['new name'] = ['This', 'is', 'the', 'row']
df5

NameError: name 'df5' is not defined

In [27]:
df5.set_index('new name', inplace=True)
df5

NameError: name 'df5' is not defined

In [28]:
df5.mean()

NameError: name 'df5' is not defined

In [29]:
df7 = pd.DataFrame({"customer": ['101','102','103','104'],
                   'category': ['cat2','cat2','cat1','cat3'],
                   'important': ['yes','no','yes','yes'],
                   'sales': [123,52,214,663]})#,index=[0,1,2,3])
df7

  customer category important  sales
0      101     cat2       yes    123
1      102     cat2        no     52
2      103     cat1       yes    214
3      104     cat3       yes    663

In [30]:
df8 = pd.DataFrame({"customer": ['101','103','104','105'],
                   'color': ['yellow','green','green','blue'],
                   'distance': [12,9,44,21],
                   'sales': [123,214,663,331]})#,index=[4,5,6,7])
df8

  customer   color  distance  sales
0      101  yellow        12    123
1      103   green         9    214
2      104   green        44    663
3      105    blue        21    331

In [31]:
pd.concat([df7,df8],axis=0,sort=False)

  customer category important  sales   color  distance
0      101     cat2       yes    123     NaN       NaN
1      102     cat2        no     52     NaN       NaN
2      103     cat1       yes    214     NaN       NaN
3      104     cat3       yes    663     NaN       NaN
0      101      NaN       NaN    123  yellow      12.0
1      103      NaN       NaN    214   green       9.0
2      104      NaN       NaN    663   green      44.0
3      105      NaN       NaN    331    blue      21.0

In [32]:
pd.concat([df7,df8],axis=0,sort=True)

  category   color customer  distance important  sales
0     cat2     NaN      101       NaN       yes    123
1     cat2     NaN      102       NaN        no     52
2     cat1     NaN      103       NaN       yes    214
3     cat3     NaN      104       NaN       yes    663
0      NaN  yellow      101      12.0       NaN    123
1      NaN   green      103       9.0       NaN    214
2      NaN   green      104      44.0       NaN    663
3      NaN    blue      105      21.0       NaN    331

In [33]:
pd.concat([df7,df8],axis=1,sort=False)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes    123      101  yellow        12    123
1      102     cat2        no     52      103   green         9    214
2      103     cat1       yes    214      104   green        44    663
3      104     cat3       yes    663      105    blue        21    331

In [34]:
pd.merge(df7,df8,how='outer',on='customer')

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow      12.0    123.0
1      102     cat2        no     52.0     NaN       NaN      NaN
2      103     cat1       yes    214.0   green       9.0    214.0
3      104     cat3       yes    663.0   green      44.0    663.0
4      105      NaN       NaN      NaN    blue      21.0    331.0

In [35]:
df7.join(df8,how='outer')

ValueError: columns overlap but no suffix specified: Index(['customer', 'sales'], dtype='object')

In [36]:
pd.merge(df7,df8,how='inner',on='customer')

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow        12      123
1      103     cat1       yes      214   green         9      214
2      104     cat3       yes      663   green        44      663

In [37]:
pd.merge(df7,df8,how='left',on='customer')

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow      12.0    123.0
1      102     cat2        no       52     NaN       NaN      NaN
2      103     cat1       yes      214   green       9.0    214.0
3      104     cat3       yes      663   green      44.0    663.0

In [38]:
pd.merge(df7,df8,how='right',on='customer')

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow        12      123
1      103     cat1       yes    214.0   green         9      214
2      104     cat3       yes    663.0   green        44      663
3      105      NaN       NaN      NaN    blue        21      331

In [39]:
df9 = pd.DataFrame({"Q1": ['101','102','103'],
                   'Q2': ['201','202','203']}
                   ,index=['I0','I1','I2'])
df9

     Q1   Q2
I0  101  201
I1  102  202
I2  103  203

In [40]:
df10 = pd.DataFrame({"Q3": ['301','302','303'],
                   'Q4': ['401','402','403']}
                   ,index=['I0','I2','I3'])
df10

     Q3   Q4
I0  301  401
I2  302  402
I3  303  403

In [41]:
df9.join(df10,how='outer')

     Q1   Q2   Q3   Q4
I0  101  201  301  401
I1  102  202  NaN  NaN
I2  103  203  302  402
I3  NaN  NaN  303  403

In [42]:
df9.join(df10,how='right')

     Q1   Q2   Q3   Q4
I0  101  201  301  401
I2  103  203  302  402
I3  NaN  NaN  303  403

In [43]:
df8

  customer   color  distance  sales
0      101  yellow        12    123
1      103   green         9    214
2      104   green        44    663
3      105    blue        21    331

In [44]:
df8['color'].unique()

array(['yellow', 'green', 'blue'], dtype=object)

In [45]:
df8['color'].value_counts()

green     2
blue      1
yellow    1
Name: color, dtype: int64

In [46]:
df9.mean()

Q1    33700701.0
Q2    67067401.0
dtype: float64

In [47]:
df8.columns

Index(['customer', 'color', 'distance', 'sales'], dtype='object')

In [48]:
df8

  customer   color  distance  sales
0      101  yellow        12    123
1      103   green         9    214
2      104   green        44    663
3      105    blue        21    331

In [49]:
new_df = df8[(df8['customer']!= '105') & (df8['color'] != 'green')]
new_df

  customer   color  distance  sales
0      101  yellow        12    123

In [50]:
print(df8['sales'].mean())
print(df8['distance'].min())

332.75
9

In [51]:
print(df8['sales'].sum())
print(df8['distance'].min())

1331
9

In [52]:
def profit(s):
    return s*0.5 # 50% markup...

In [53]:
df8['sales'].apply(profit)

0     61.5
1    107.0
2    331.5
3    165.5
Name: sales, dtype: float64

In [55]:
df8['color'].apply(len)

0    6
1    5
2    5
3    4
Name: color, dtype: int64

In [56]:
df11 = df8[['distance','sales']]
df11.applymap(profit)

   distance  sales
0       6.0   61.5
1       4.5  107.0
2      22.0  331.5
3      10.5  165.5

In [57]:
def col_sum(co):
    return sum(co)
df11.apply(col_sum)

distance      86
sales       1331
dtype: int64

In [58]:
df11.applymap(col_sum)  # Not understand

TypeError: 'int' object is not iterable

In [59]:
del df8['color']
df8

  customer  distance  sales
0      101        12    123
1      103         9    214
2      104        44    663
3      105        21    331

In [60]:
df8.index # diffrent output # Not understand

RangeIndex(start=0, stop=4, step=1)

In [70]:
df8.sort_values(by='distance')

  customer  distance  sales
1      103         9    214
0      101        12    123
3      105        21    331
2      104        44    663

In [69]:
df8

  customer  distance  sales
1      103         9    214
0      101        12    123
3      105        21    331
2      104        44    663

In [71]:
df8.sort_values(by='distance', inplace=True)

In [72]:
df8

  customer  distance  sales
1      103         9    214
0      101        12    123
3      105        21    331
2      104        44    663

In [73]:
mydict = {'customer':['Customer 1','Customer 1','Customer2','Customer2','Customer3','Customer3'],
          'product1':[1.1,2.1,3.8,4.2,5.5,6.9],
          'product2':[8.2,9.1,11.1,5.2,44.66,983]}
df6 = pd.DataFrame(mydict,index=['Purchase 1','Purchase 2','Purchase 3','Purchase 4','Purchase 5','Purchase 6'])
df6

              customer  product1  product2
Purchase 1  Customer 1       1.1      8.20
Purchase 2  Customer 1       2.1      9.10
Purchase 3   Customer2       3.8     11.10
Purchase 4   Customer2       4.2      5.20
Purchase 5   Customer3       5.5     44.66
Purchase 6   Customer3       6.9    983.00

In [75]:
grouped_data = df6.groupby('customer')
print(grouped_data)
grouped_data

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000018786D3F2E0>

In [76]:
grouped_data.describe()

           product1                                           product2  \
              count mean       std  min   25%  50%   75%  max    count
customer
Customer 1      2.0  1.6  0.707107  1.1  1.35  1.6  1.85  2.1      2.0
Customer2       2.0  4.0  0.282843  3.8  3.90  4.0  4.10  4.2      2.0
Customer3       2.0  6.2  0.989949  5.5  5.85  6.2  6.55  6.9      2.0


              mean         std    min      25%     50%      75%    max
customer
Customer 1    8.65    0.636396   8.20    8.425    8.65    8.875    9.1
Customer2     8.15    4.171930   5.20    6.675    8.15    9.625   11.1
Customer3   513.83  663.506577  44.66  279.245  513.83  748.415  983.0

In [78]:
grouped_data.mean()

            product1  product2
customer
Customer 1       1.6      8.65
Customer2        4.0      8.15
Customer3        6.2    513.83

In [93]:
df8.to_csv('df8.csv', index=True)

In [96]:
new_df8 = pd.read_csv('df8.csv', index_col=0)
new_df8

   customer  distance  sales
5       103         9    214
4       101        12    123
7       105        21    331
6       104        44    663

In [95]:
new_df8 = pd.read_csv('df8.csv', index_col=1)
new_df8

          Unnamed: 0  distance  sales
customer
103                1         9    214
101                0        12    123
105                3        21    331
104                2        44    663

In [98]:
new_df8 = pd.read_csv('df8.csv')
new_df8

   Unnamed: 0  customer  distance  sales
0           5       103         9    214
1           4       101        12    123
2           7       105        21    331
3           6       104        44    663

In [101]:
df8.to_excel('df8.xlsx', index=False, sheet_name='first sheet')
newer_df8 = pd.read_excel('df8.xlsx', sheet_name='first sheet', index_col=1)
newer_df8

          customer  sales
distance
9              103    214
12             101    123
21             105    331
44             104    663

In [2]:
import pandas as pd

In [5]:
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
type(s1)

pandas.core.series.Series

In [9]:
l1 = [1,2,3,4,5]
l1

[1, 2, 3, 4, 5]

In [10]:
s2 = pd.Series(l1)
s2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [12]:
s3 = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [15]:
s4 = pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5}, index=['d','b','f','e','c','a'])
s4

d    4.0
b    2.0
f    NaN
e    5.0
c    3.0
a    1.0
dtype: float64

In [26]:
s5 = pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5})
s5

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [27]:
s5 + 5

a     6
b     7
c     8
d     9
e    10
dtype: int64

In [28]:
s6 = pd.Series([1,2,3,4,5,6,7,8,9])
s6[3]

4

In [30]:
s7 = pd.Series([1,2,3,4,5,6,7,8,9])
s7[-3:]

6    7
7    8
8    9
dtype: int64

In [36]:
s6, s6, s6+s7, s6 - s7

(0    1
 1    2
 2    3
 3    4
 4    5
 5    6
 6    7
 7    8
 8    9
 dtype: int64,
 0    1
 1    2
 2    3
 3    4
 4    5
 5    6
 6    7
 7    8
 8    9
 dtype: int64,
 0     2
 1     4
 2     6
 3     8
 4    10
 5    12
 6    14
 7    16
 8    18
 dtype: int64,
 0    0
 1    0
 2    0
 3    0
 4    0
 5    0
 6    0
 7    0
 8    0
 dtype: int64)

In [37]:
s7 = pd.Series([1,2,3,4,5,6,7,8,9])
s7[:4]

0    1
1    2
2    3
3    4
dtype: int64

In [44]:
pd.DataFrame({"Name":['Bob','Sam','Anne'],"Marks":[75,25,92]})

   Name  Marks
0   Bob     75
1   Sam     25
2  Anne     92

In [47]:
df1 = pd.DataFrame({"Name":['Bob','Sam','Anne','Matt'],"Marks":[75,25,92,99]})
df1

   Name  Marks
0   Bob     75
1   Sam     25
2  Anne     92
3  Matt     99

In [57]:
iris = pd.read_csv('iris.csv')

In [58]:
iris.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [60]:
iris.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [62]:
iris.shape

(150, 5)

In [65]:
iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [72]:
iris.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [74]:
iris.iloc[0:3,0:2]

   Sepal.Length  Sepal.Width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2

In [77]:
iris.loc[0:3,("Sepal.Length","Petal.Length")]

   Sepal.Length  Petal.Length
0           5.1           1.4
1           4.9           1.4
2           4.7           1.3
3           4.6           1.5

In [79]:
iris.drop("Sepal.Length",axis=1)

     Sepal.Width  Petal.Length  Petal.Width    Species
0            3.5           1.4          0.2     setosa
1            3.0           1.4          0.2     setosa
2            3.2           1.3          0.2     setosa
3            3.1           1.5          0.2     setosa
4            3.6           1.4          0.2     setosa
..           ...           ...          ...        ...
145          3.0           5.2          2.3  virginica
146          2.5           5.0          1.9  virginica
147          3.0           5.2          2.0  virginica
148          3.4           5.4          2.3  virginica
149          3.0           5.1          1.8  virginica

[150 rows x 4 columns]

In [87]:
iris.drop([1,2,3],axis=0)

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
5             5.4          3.9           1.7          0.4     setosa
6             4.6          3.4           1.4          0.3     setosa
7             5.0          3.4           1.5          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[147 rows x 5 columns]

In [89]:
iris.mean()

Sepal.Length    5.843333
Sepal.Width     3.057333
Petal.Length    3.758000
Petal.Width     1.199333
dtype: float64

In [91]:
iris.median()

Sepal.Length    5.80
Sepal.Width     3.00
Petal.Length    4.35
Petal.Width     1.30
dtype: float64

In [93]:
iris.min()

Sepal.Length       4.3
Sepal.Width          2
Petal.Length         1
Petal.Width        0.1
Species         setosa
dtype: object

In [94]:
iris.max()

Sepal.Length          7.9
Sepal.Width           4.4
Petal.Length          6.9
Petal.Width           2.5
Species         virginica
dtype: object

In [95]:
def half(s):
    return s*0.5

In [99]:
iris[['Sepal.Length','Petal.Length']].apply(half)

     Sepal.Length  Petal.Length
0            2.55          0.70
1            2.45          0.70
2            2.35          0.65
3            2.30          0.75
4            2.50          0.70
..            ...           ...
145          3.35          2.60
146          3.15          2.50
147          3.25          2.60
148          3.10          2.70
149          2.95          2.55

[150 rows x 2 columns]

In [100]:
iris[['Sepal.Length','Petal.Length']]

     Sepal.Length  Petal.Length
0             5.1           1.4
1             4.9           1.4
2             4.7           1.3
3             4.6           1.5
4             5.0           1.4
..            ...           ...
145           6.7           5.2
146           6.3           5.0
147           6.5           5.2
148           6.2           5.4
149           5.9           5.1

[150 rows x 2 columns]

In [105]:
def double_make(s):
    return s*2

In [107]:
iris[['Sepal.Length','Petal.Length']].apply(double_make)

     Sepal.Length  Petal.Length
0            10.2           2.8
1             9.8           2.8
2             9.4           2.6
3             9.2           3.0
4            10.0           2.8
..            ...           ...
145          13.4          10.4
146          12.6          10.0
147          13.0          10.4
148          12.4          10.8
149          11.8          10.2

[150 rows x 2 columns]

In [109]:
iris['Species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: Species, dtype: int64

In [111]:
iris.sort_values(by='Sepal.Length')

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
13            4.3          3.0           1.1          0.1     setosa
42            4.4          3.2           1.3          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
135           7.7          3.0           6.1          2.3  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

In [114]:
df1.from_items

AttributeError: 'DataFrame' object has no attribute 'from_items'

In [115]:
df1.from_dict

In [117]:
iris.iloc[0:6,0:4]

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4

In [121]:
s1=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64